conf/src/Catalogs/КомандыОбъектовМетаданных/КомандыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомандыОбъектовМетаданных</name>
  <owners>Catalog.ОбъектыМетаданных</owners>
  <attributes>
    <name>uuid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяетДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствуетВОсновномХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТехническийПроектИсточник</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКоманд</name>
    <type>
      <types>EnumRef.СтандартныеГруппыКоманд</types>
      <types>CatalogRef.ОбъектыМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаИсточник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Enums/ТипыВеток/ТипыВеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВеток</name>
  <enumValues>
    <name>ОсновнаяВеткаПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВеткаТехническогоПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаДляИсправленияОшибок</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/Ветки/Ветки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ветки</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ВариантЗапускаТестов</name>
    <type>
      <types>EnumRef.ВариантыЗапускаТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТестирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПомещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапросаНаСлияние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияПомещаютсяТолькоЧерезДругиеВетки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЗапускаТестирования</name>
    <type>
      <types>CatalogRef.НастройкиЗапускаТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предшественник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетТестирования</name>
    <type>
      <types>EnumRef.ПриоритетыТестированияВеток</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРазработки</name>
    <type>
      <types>EnumRef.РежимРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьИсправленияОшибок</name>
    <type>
      <types>EnumRef.СрочностьИсправленияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВеток</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВеток</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/КомандыОбъектовМетаданных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец.Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеЗаполненияВеткиИсточника(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КомандыОбъектовМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КомандыОбъектовМетаданных КАК КомандыОбъектовМетаданных
	|ГДЕ
	|	КомандыОбъектовМетаданных.УдалитьТехническийПроектИсточник <> ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	|	И КомандыОбъектовМетаданных.УдалитьТехническийПроектИсточник.Ветка.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыВеток.ВеткаТехническогоПроекта)
	|	И КомандыОбъектовМетаданных.ВеткаИсточник = ЗНАЧЕНИЕ(Справочник.Ветки.ПустаяСсылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляЗаполненияВеткиИсточника(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.КомандыОбъектовМетаданных";
	
	СписокОбъектов = Новый Массив;
	
	ВыборкаОбъектовДляОбработки = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока ВыборкаОбъектовДляОбработки.Следующий() Цикл
		СписокОбъектов.Добавить(ВыборкаОбъектовДляОбработки.Ссылка);
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КомандыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	КомандыОбъектовМетаданных.УдалитьТехническийПроектИсточник.Ветка КАК ВеткаИсточник
	|ИЗ
	|	Справочник.КомандыОбъектовМетаданных КАК КомандыОбъектовМетаданных
	|ГДЕ
	|	КомандыОбъектовМетаданных.Ссылка В(&СписокОбъектов)"
	;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НачатьТранзакцию();
						
			// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОтменитьТранзакцию();
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ВеткаИсточник) Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Объект);
			Иначе
				Объект.ВеткаИсточник = Выборка.ВеткаИсточник;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось указать ветку-источник для объекта %ИмяОбъекта%: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,
			                         Выборка.Ссылка,
			                         ТекстСообщения);
			
		КонецПопытки;
									
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = 
		Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
